Staok/Mini-DSO-WaveGen-in-one/老刘爱捣鼓STC8A示波器/Mini-DSO-master-STC8A8K64D4实验箱版本-20220513/Code/main.c
        /* ADCRuning和WaveScroll同时置位时，不开启外部中断0（编码器旋转）
           Not to enable external interrupt 0(Encoder Rotation) when both of ADCRunning and WaveScroll set. */
//        if (!WaveScroll)
//        {
//            IE0 = 0;
//            EX0 = 1;
//        }
    }

    /* ADC采样停止
       ADC Sampling Stopped */
    else
    {
        while (!ADCRunning && !InSettings)
        {
            if (DisplayUpdate)
            {
//                EX0 = 0;
                DisplayUpdate = 0;
                if (WaveUpdate)
                {
                    WaveUpdate = 0;
                    /* 分析缓存中完成采样的采样数据
                       Analyse completed sampling data in buffer */
                    AnalyseData();
                    ClearDisplay = 1;

                    /* 清空屏幕，绘制波形
                       Clear display and draw waveform */
                    if (ScaleH == ScaleH_tmp)
                    {
                        /* 采样点数有限，不支持横向缩放波形，只有时间区间与完成采样的时间区间相同才绘制波形
                           Since the sampling points limitation, scaling waveform along horizontal is not support.
                           Show waveform only when time scale is same as that when sampling completed */
                        PlotChart();
                        PlotWave();
                    }

                    /* 清空屏幕，不绘制波形
                       Clear display and no waveform */
                    else
                    {
                        WaveFreq = 0; //清零WaveFreq，绘制界面时，频率位置会显示****Hz
                        PlotChart();
                    }
                }
                /* 只更新屏幕上的参数，波形不变
                   Update parameters on display only, keep waveform */
                else
                {
                    ClearDisplay = 0;
                    PlotChart();
                }

                OLED_Display();
//                IE0 = 0;
//                EX0 = 1;
            }
        }
    }
}

void runWhenADCComplete()
{
    /*  ADC采样完成 - 单次触发
        ADC Sampling Complete - Single Trigger Mode */
    if (TriMode == 2)
    {
//        EX0 = 0;
        ADCInterrupt = 1;
        DisplayUpdate = 0;
        WaveUpdate = 0;
        ADCRunning = 0; //清零ADC运行标志，停止采样
        AnalyseData();
        ClearDisplay = 1;
        PlotChart();
        PlotWave();
        OLED_Display();
//        IE0 = 0;
//        EX0 = 1;
    }

    /*  ADC采样完成 - 自动触发或普通触发
        ADC Sampling Complete - Auto or Normal Trigger Mode */
    else
    {
        //EX0 = 0;
        ClearDisplay = 1; //置位清空屏幕标志
        AnalyseData();    //分析采样数据
        PlotChart();      //绘制主界面
        PlotWave();       //绘制波形
        OLED_Display();
        //IE0 = 0;
        //EX0 = 1;
    }
}

#define Timer1_Reload   (65536UL -(27000000UL / 1000))       //Timer 1 中断频率, 1000次/秒
void Timer1Init(void)		//1毫秒@27.000MHz
{
	AUXR |= 0x40;		//定时器时钟1T模式
	TMOD &= 0x0F;		//设置定时器模式
//	TL1 = 0x88;		//设置定时初始值
//	TH1 = 0x96;		//设置定时初始值
	TH1 = (uint8)(Timer1_Reload / 256);
	TL1 = (uint8)(Timer1_Reload % 256);
	TF1 = 0;		//清除TF1标志
    ET1 = 1;		//允许中断
	TR1 = 1;		//定时器1开始计时
}

/* 程序入口
   Program Entry */
void main()
{
    P_SW2 |= 0x80;  //XFR访问使能
    
    /* 将ADC端口P0.4，P0.6设置为高阻
       Set ADC port P0.4, P0.6 as high-impedance */
//    P0M1 |= 0x50;
//    P0M0 &= ~0x50;
    P0M1 = 0x50;
    P0M0 = 0x00;

    /* 设置指示灯端口P1.1为推挽输出
       Set indicator port P1.1 as push-pull output */
//    P1M1 &= ~0x02;
//    P1M0 |= 0x02;
    P1M1 = 0x00;
    P1M0 = 0x02;

    /* 设置编码器端口P3.2，P3.3，P3.4为准双向
       Set Encoder port P3.2, P3.3, P3.4 as quasi bidirectional */
//    P3M1 &= ~0x1C;
//    P3M0 &= ~0x1C;
    P3M1 = 0x00;
    P3M0 = 0x00;

    /* 设置OLED端口P2.3，P2.4，P2.5，P2.6，P2.7为准双向
       Set OLED port P2.3, P2.4, P2.5, P2.6 as quasi bidirectional */
//    P2M1 &= ~0xF8;
//    P2M0 &= ~0xF8;
    P2M1 = 0x00;
    P2M0 = 0x00;

    /* 设置指示灯端口P4.0为推挽输出
       Set indicator port P4.0 as push-pull output */
//    P4M1 = 0x00;
//    P4M0 = 0x01;
//    P40 = 1;  //P40脚作为OLED电源脚

    /* 编码器旋转外部中断 
       Interrupt for rotating of Encoder */
//    IT0 = 0; //外部中断0触发方式，上升沿和下降沿
//    PX0 = 1; //外部中断0高优先级，可打断按键中断，用于判断按下同时旋转
//    EX0 = 1; //开启外部中断0

    /* 编码器按键外部中断 
       Interrupt for clicking of Encoder */
//    IT1 = 1; //外部中断1触发方式，下降沿
//    PX1 = 0; //外部中断1低优先级
//    EX1 = 1; //开启外部中断1

    /* 定时器0，为更新电池电压信息计时
       Timer 0, for updating voltage of battery */
    AUXR &= 0x7F; //定时器时钟12T模式
    TMOD &= 0xF0; //设置定时器模式
    TL0 = 0x46;   //设置定时初值 //27MHz，25ms
    TH0 = 0x24;   //设置定时初值
    TF0 = 0;      //清除TF0标志
    ET0 = 1;      //允许定时器0中断
    
    Timer1Init();

    IAP_TPS = 27; //设置EEPROM操作时间 27MHz/1000000

    /* 开总中断
       Enable global interrupt */
    EA = 1;

    //UartInit();

    Read_Options();
    init();
    OLED_Init();
    OLED_SetFontWidth(6);
    PlotChart();
    OLED_Display();

    while (1)
    {
        P_Ready = 0;

        /* 采样波形
           Sampling*/
        GetWaveData();
        
        /* 进入设置界面
           Enter Settings Interface */
        if (InSettings)
        {
            runWhenInSettrings();
        }

        /* ADC采样中断
           ADC Sampling Interrupt */
        else if (ADCInterrupt)
        {
            runWhenADCInterrupt();
        }

        /* ADC采样完成
           ADC Sampling Complete */
        else
        {
            runWhenADCComplete();
        }
    }
}

#if 0
/* 分析编码器旋转
   Analyse Rotation of Encoder */
void Scan_EC11(void)
{
    /* 延时去抖动
       Delay to remove jitter */
    Delay500us();

    /* 正转
       Clockwise */
    if (EC11_A != EC11_B)
    {
        Change_Val(1);
    }

    /* 反转
       Anticlockwise */
    else if (EC11_A == EC11_B)
    {
        Change_Val(0);
    }
}

/* 编码器旋转中断
   Interrput for Encoder Rotated */
void INT0_interrupt(void) interrupt INT_0
{
    Delay500us();

    /* 编码器是否被按下
       Whether the Encoder is pressed */
    if (!EC11_KEY)
        EC11PressAndRotate = 1;
    else
        EC11PressAndRotate = 0;

    Scan_EC11();
    ADCInterrupt = 1;
    DisplayUpdate = 1;
    IE1 = 0; //清零外部中断1标志位
    IE0 = 0; //清零外部中断0标志位
}

