Staok/Mini-DSO-WaveGen-in-one/老刘爱捣鼓STC8A示波器/Mini-DSO-master-STC8A8K64D4实验箱版本-20220513/Code/main.c
/* 编码器点击中断
   Interrput for Encoder Pressed */
void INT1_interrupt(void) interrupt INT_1
{
    Delay50ms();
    if (!EC11_KEY)
    {
        EC11PressAndRotate = 0;

        /*  长按编码器按键 - 切换主界面和设置界面
            Long presse Encoder - Switch main interface and settings interface */
        if (Delay800ms_Long_Press())
        {
            InSettings = ~InSettings;

            /*  进入设置界面
                Enter Settings  */
            if (InSettings)
            {
                DisplayUpdate = 1;
                UpdateVbat = 1;
                TF0 = 0; //清零定时器0溢出标志
                TR0 = 1; //定时器0开始计时，开始电池电压信息更新计时
                IE0 = 0; //清零外部中断0中断标志
                EX0 = 1; //开启外部中断0（编码器旋转）
            }

            /*  回到主界面
                Retrurn to main interface   */
            else
            {
                TR0 = 0; //清零定时器0溢出标志
                TF0 = 0; //定时器0停止计时，停止电池电压信息更新计时
                WaveFreq = 0;
                TriFail = 0;
                VMax = 0;
                VMin = 0;
                DisplayUpdate = 1;
                WaveUpdate = 1;
                ClearWave = 0;
            }
            ADCInterrupt = 1;
        }

        /*  按住编码器同时旋转
            Rotate Encoder while pressing  */
        else if (EC11PressAndRotate)
        {
            /* 由编码器旋转中断执行操作
               Operations Performed by Interrupt of Encoder Rotation */
        }

        /* 双击编码器按键 - 在主界面，滚动波形和选项模式之间切换
           Double click Encoder - Switch between Waveform Scroll Mode and Parameter Mode in Main Interface */
        else if (Delay300ms_Double_Click())
        {
            /* 主界面
               Main Interface*/
            if (!InSettings)
            {
                WaveScroll = ~WaveScroll;
                OptionChanged = 1;
                ADCInterrupt = 1;
                DisplayUpdate = 1;
                ClearWave = 0;
            }
        }

        /*  单击编码器按键 - 在主界面，切换Stop/Run状态
            Single click Encoder - Switch Run/Stop in main interface    */
        else if (!InSettings)
        {
            EX0 = 0;
            ADCRunning = ~ADCRunning;
            if (ADCRunning)
            {
                WaveUpdate = 1;
                ClearWave = 1;
            }
            else
            {
                DisplayUpdate = 1;
                WaveUpdate = 1;
            }
            ADCInterrupt = 1;
            IE0 = 0;
            IE1 = 0;
        }
    }
    IE1 = 0;
}
#endif

/* 为更新Vbat计时
   Timer for updating Vbat */
void TIMER0_interrupt(void) interrupt TIMER_0
{
    static uint8 n;

    if (++n >= VBAT_UPDATE_FREQ)
    {
        n = 0;
        UpdateVbat = 1;
        DisplayUpdate = 1;
    }
}

void TIMER1_interrupt(void) interrupt 3
{
    KeyScan();
}

//========================================================================
// 函数: void KeyScan(void)
// 描述: 按键扫描函数。
// 参数: none.
// 返回: none.
// 版本: VER1.0
// 日期: 2013-4-1
// 备注: 
//========================================================================
void KeyScan(void)
{
	//短按按键
	if(!KEY1)
	{
		if(!Key1_Flag)
		{
			Key1_cnt++;
			if(Key1_cnt >= KEY_TIMER)	//30ms防抖
			{
				Key1_Flag = 1;			//设置按键状态，防止重复触发
                Change_Val(1);      /* 正转  Clockwise */
//				Key1_Function = 1;
			}
		}
	}
	else
	{
		Key1_cnt = 0;
		Key1_Flag = 0;
	}

	//短按按键
	if(!KEY2)
	{
		if(!Key2_Flag)
		{
			Key2_cnt++;
			if(Key2_cnt >= KEY_TIMER)	//30ms防抖
			{
				Key2_Flag = 1;			//设置按键状态，防止重复触发
                Change_Val(0);      /* 反转  Anticlockwise */
//				Key2_Function = 1;
			}
		}
	}
	else
	{
		Key2_cnt = 0;
		Key2_Flag = 0;	//按键释放
	}

	//单纯短按按键
	if(!KEY3)
	{
		if(!Key3_Flag)
		{
			Key3_cnt++;
			if(Key3_cnt >= KEY_TIMER)	//30ms防抖
			{
				Key3_Flag = 1;			//设置按键状态，防止重复触发
//				Key3_Function = 1;

                /* 切换主界面和设置界面 - Switch main interface and settings interface */
                InSettings = ~InSettings;

                /*  进入设置界面
                    Enter Settings  */
                if (InSettings)
                {
                    DisplayUpdate = 1;
                    UpdateVbat = 1;
                    TF0 = 0; //清零定时器0溢出标志
                    TR0 = 1; //定时器0开始计时，开始电池电压信息更新计时
                }

                /*  回到主界面
                    Retrurn to main interface   */
                else
                {
                    TR0 = 0; //清零定时器0溢出标志
                    TF0 = 0; //定时器0停止计时，停止电池电压信息更新计时
                    WaveFreq = 0;
                    TriFail = 0;
                    VMax = 0;
                    VMin = 0;
                    DisplayUpdate = 1;
                    WaveUpdate = 1;
                    ClearWave = 0;
                }
                ADCInterrupt = 1;
			}
		}
	}
	else
	{
		Key3_cnt = 0;
		Key3_Flag = 0;
	}

	//长按短按按键
	if(!KEY4)
	{
		if(!Key4_Flag)
		{
			Key4_cnt++;
			if(Key4_cnt >= 1000)		//长按1s
			{
				Key4_Short_Flag = 0;	//清除短按标志
				Key4_Long_Flag = 1;		//设置长按标志
				Key4_Flag = 1;				//设置按键状态，防止重复触发
//				Key4_Long_Function = 1;

                /* 在主界面，滚动波形和选项模式之间切换 - Switch between Waveform Scroll Mode and Parameter Mode in Main Interface */

                /* 主界面
                   Main Interface*/
                if (!InSettings)
                {
                    WaveScroll = ~WaveScroll;
                    OptionChanged = 1;
                    ADCInterrupt = 1;
                    DisplayUpdate = 1;
                    ClearWave = 0;
                }
			}
			else if(Key4_cnt >= KEY_TIMER)	//30ms防抖
			{
				Key4_Short_Flag = 1;		//设置短按标志
			}
		}
	}
	else
	{
		if(Key4_Short_Flag)			//判断是否短按
		{
			Key4_Short_Flag = 0;	//清除短按标志
//			Key4_Short_Function = 1;

            /* 在主界面，切换Stop/Run状态 - Switch Run/Stop in main interface    */
            if (!InSettings)
            {
                ADCRunning = ~ADCRunning;
                if (ADCRunning)
                {
                    WaveUpdate = 1;
                    ClearWave = 1;
                }
                else
                {
                    DisplayUpdate = 1;
                    WaveUpdate = 1;
                }
                ADCInterrupt = 1;
            }
		}
		Key4_cnt = 0;
		Key4_Flag = 0;	//按键释放
	}
}
